---
kind: method
id: M:Autodesk.Revit.DB.SolidCurveIntersectionOptions.Dispose
source: html/e8bae6da-3f0d-cb39-9d7f-97bcc20ed083.htm
---
# Autodesk.Revit.DB.SolidCurveIntersectionOptions.Dispose Method

Releases all resources used by the SolidCurveIntersectionOptions

## Syntax (C#)
```csharp
public void Dispose()
```